# GetAssemblyCodeTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyCodeTable..::..GetAssemblyCodeTable Method
AssemblyCodeTable Class See Also
---
Returns the AssemblyCodeTable for the specified document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static AssemblyCodeTable GetAssemblyCodeTable(
	Document doc
)
```

Visual Basic
---
```text
Public Shared Function GetAssemblyCodeTable ( _
	doc As Document _
) As AssemblyCodeTable
```

Visual C++
---
```text
public:
static AssemblyCodeTable^ GetAssemblyCodeTable(
	Document^ doc
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document The document owns the AssemblyCodeTable.
# ### Return Value
The AssemblyCodeTable for the document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AssemblyCodeTable Class
Autodesk.Revit.DB Namespace